app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "video") VALUES (?, ?, ?, ?, ?)  [["content", "gfhgfh"], ["created_at", "2014-06-15 18:07:23.871968"], ["title", "ghghgfh"], ["updated_at", "2014-06-15 18:07:23.871968"], ["video", "Screencast_from_01-16-14_13_09_38.webm"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save